{
    "education": "JSS Science & Technology University Mysore",
    "experience": [
        {
            "date": "August 2023 – July 2024",
            "place": "Bengaluru",
            "org-name": "Fidelity Investments",
            "technologies": "Snowflake",
            "role": "Data Engineer",
            "description": "• Developed a python-based reconciliation framework for weekly data checks, reducing mismatches by 20% post-migration. • Implemented Azure-based Snowflake SSO for 27 squads, enhancing security by giving an alternative to Ping Federate. • Architected FinOps ETL with SnapLogic, redesigned and deployed Snowflake data models via Jenkins CI/CD impacting 7 squads. • Integrated Apache Iceberg with Snowflake using AWS Glue Catalog and leveraged within Fidelity’s data collaboration platform, contributing to a reduction in data migration pipelines and resulting in an overall cost cut by 3%. • Innovated an automation tool during global hackathon, saving 800 hours/month for legal risk and compliance team using Streamlit, AWS Textract, and Python."
        },
        {
            "date": "February 2023 – July 2023",
            "place": "Bengaluru",
            "org-name": "Fidelity Investments",
            "technologies": "NLP, FastAPI, AWS",
            "role": "Data Engineer Intern",
            "description": "• Innovated a cloud data classification solution using transformer models and NLP, enabling the cloud team to identify frequently asked questions and errors, which led to a 25% reduction in error rates. • Built RESTful APIs using FastAPI, enhancing data handling capabilities; enabled efficient data exchange between services, resulting in a reduced processing time from 4 seconds to 1.5 seconds per request."
        },
        {
            "date": "March 2022 – January 2023",
            "place": "Freelance",
            "org-name": "Freelance Work",
            "technologies": "Azure, Great Expectations, Python, LLM, NLP, FastAPI",
            "role": "Freelance Data Engineer",
            "description": "• Spearheaded the development of backend endpoints using FastAPI, enhancing automated reconciliation processes that streamlined data quality checks and efficiency for insurance data management, positively impacting operations for 70,000 customers. • Migrated over 50 scripts to Azure Functions, saving 80 hours/month; secured data with Azure Key Vault. • Built a pipeline for resume retrieval from Azure Blob Storage and fine-tuned an LLM for NLP, achieving 85% accuracy. Developed a FastAPI-based search engine with a QA bot, streamlining resume screening."
        },
        {
            "date": "August 2022 – November 2022",
            "place": "GE Healthcare",
            "org-name": "GE Healthcare",
            "technologies": "NLP, Python",
            "role": "Data Science Intern",
            "description": "• Architected a spaCy-based NLP solution that streamlined the retrieval of critical text from service manuals, increasing the efficiency of knowledge workflows and empowering the support team to handle 30% more inquiries daily."
        },
        {
            "date": "September 2020 – May 2021",
            "place": "General Intelligence (formerly Intelligent Mobility Labs)",
            "org-name": "General Intelligence",
            "technologies": "Computer Vision, Python",
            "role": "Deep Learning Engineer Intern",
            "description": "• Devised YOLOv5 enhancements to refine the object detection model, elevating accuracy by 5%. • Enhanced semantic segmentation model to 87% accuracy using U-Net architecture and Conv-LSTM layers for temporal consistency."
        }
    ],
    "skills": {
        "tools_languages": "Python, Jenkins Core, FastAPI, Flask, C, C++, MySQL, PostgreSQL",
        "technologies": "Snowflake, NLP, Machine Learning, Deep Learning, AWS, Azure, PowerBI, SnapLogic",
        "coding_platforms": "CodeChef, Hackerrank, GeeksforGeeks",
        "roles_and_honours": "Teaching Assistant, Vice-Chairman (Computer Society of India), Technical Head & Placement Secretary (Placement Cell SJCE)",
        "accomplishments": "1st Runner Up in Fidelity Investment’s Hackathon conducted globally, Acquired AI Engineer Certificate from Pro5.ai, Ranked Top 5% in Data Structures and Algorithms Course, CodeKaze - Ranked 1st among 500+ participants, CodeChef - 3-Star Rating, Highest Rating: 1612, Highest Rank: 985."
    },
    "contact_information": {
        "Name": "Vishal Mishra",
        "Email": "aadeevishal@gmail.com",
        "Phone Number": "+91-7091174689",
        "Portfolio_LinkedIn": "linkedin.com/in/aadeevishal"
    }
}
